{
    "0": {
        "0": "Ensure smooth, controlled, and gentle handling of the object during movement and placement.",
        "1": "The robot must lift the bowl smoothly, securely, and gently while avoiding obstacles.",
        "2": "Move the black bowl smoothly with a secure grip, avoiding obstacles, and place it gently on the plate.",
        "3": "The robot must lift and place the black bowl vertically while avoiding obstacles and ensuring gentle handling.",
        "4": "Lift the bowl smoothly, avoiding collisions and obstacles, and place it gently on the plate.",
        "5": "The robot must lift the black bowl smoothly, securely, and gently while avoiding collisions with other objects.",
        "6": "The robot must carefully lift and place the black bowl onto the plate while ensuring safety and precision in all movements.",
        "7": "Move the black bowl smoothly and securely, ensuring gentle placement on the plate.",
        "8": "Ensure smooth, controlled, and safe handling of the bowl, maintaining proper alignment and distance from obstacles during the task.",
        "9": "Move the gripper smoothly to grasp the bowl securely, placing it gently on the plate."
    },
    "1": {
        "0": "The robot must move smoothly and securely handle the metal bowl, lifting it gently from the table and placing it onto another surface without damage.",
        "1": "Gently lift the bowl, ensuring it is within reach and avoid obstacles, then place it on a stable, large plate.",
        "2": "Move the black bowl carefully, ensuring proper spacing, gentle handling, and precise alignment while navigating around obstacles.",
        "3": "Move the black bowl smoothly from the top left to the center of the table, ensuring no tilting and avoiding collisions with other objects.",
        "4": "Ensure smooth and controlled motion with adequate spacing, correct grip, even force application, steady speed, and gentle placement.",
        "5": "Move the black bowl smoothly, ensuring proper positioning, gentle lifting, obstacle-free navigation, and precise placement on the plate.",
        "6": "Ensure smooth and gentle handling of the black bowl while maintaining proper alignment and force control.",
        "7": "Lift and place the bowl smoothly over the plate without tilting.",
        "8": "Gently lift and place the black bowl onto the plate, ensuring smooth and careful alignment.",
        "9": "Move the black bowl smoothly and precisely from the table to the plate, ensuring no collisions and gentle placement."
    },
    "2": {
        "0": "Lift and place the black bowl smoothly onto the plate without collision or spillage.",
        "1": "The robot must lift the metal bowl smoothly, keeping it level and centered while moving in a straight line to place it gently on the plate.",
        "2": "Ensure smooth, controlled, and precise lifting and placement of the bowl.",
        "3": "Ensure smooth and secure handling of the bowl while navigating safely to the plate.",
        "4": "Move the bowl smoothly and gently, ensuring secure handling and placement.",
        "5": "Move the black bowl smoothly, avoiding collisions, then place it gently on the nearest plate.",
        "6": "Move the metal bowl smoothly and securely, ensuring gentle placement on the cardboard box.",
        "7": "Ensure smooth, secure, and gentle handling of the metal bowl while avoiding obstacles during transport.",
        "8": "Ensure smooth and gentle handling of the black bowl with adequate force while avoiding obstacles.",
        "9": "Move the black bowl smoothly, gripping firmly, lifting vertically, navigating around obstacles, and placing it gently on the plate."
    },
    "3": {
        "0": "Ensure smooth and controlled lifting of the bowl while maintaining alignment and trajectory for safe transfer.",
        "1": "Ensure smooth and secure handling of the bowl with controlled force for placement.",
        "2": "Move the bowl smoothly and securely from its initial position to the plate, ensuring gentle placement without damage.",
        "3": "Ensure smooth and precise robotic motion for lifting and placing a metallic bowl onto a black box.",
        "4": "Ensure smooth and precise lifting and positioning of the bowl while avoiding tilting or obstacles.",
        "5": "Ensure smooth and secure handling of the bowl during lifting and placement.",
        "6": "Ensure smooth, safe, and precise motion while handling the black bowl, avoiding damage and maintaining stability.",
        "7": "Ensure smooth and stable vertical lifting of a metallic bowl from a metallic plate to a wooden surface without damage.",
        "8": "Ensure smooth, safe, and precise handling of the black bowl while avoiding collisions and aligning it correctly.",
        "9": "Ensure smooth, secure, and accurate handling of the metal bowl while maintaining proper alignment and strength."
    },
    "4": {
        "0": "Move the black bowl smoothly, ensuring it fits securely in the drawer, lifts safely, closes the drawer quietly, navigates around obstacles, and places it carefully on the plate.",
        "1": "move smoothly and gently",
        "2": "Ensure smooth and safe motion with adequate clearance and gentle handling.",
        "3": "move smoothly and gently",
        "4": "move smoothly and gently",
        "5": "move smoothly and gently",
        "6": "Ensure safe, gentle, and obstacle-free handling of the bowl during lifting and placement.",
        "7": "Ensure smooth and safe handling of the drawer and bowl, avoiding obstacles and damage.",
        "8": "Ensure smooth, safe, and obstacle-free movement of the robot arm while handling the bowl and drawer.",
        "9": "Ensure smooth and obstacle-free navigation for the robot arm to safely interact with the drawer and place the bowl on the plate."
    }
}